doc/dokumentace.org
#+TITLE: PSP-validátor
* dokumentace
  :PROPERTIES:
  :ID:       20d91565-bc03-4147-8d00-b59825f48f37
  :END:
  Program validuje =PSP= balíček, nebo celý adresář =PSP= balíčků.

  =PSP= se používá k uchování digitálních informací o periodikách a monografiích. 
  Tento balíček používá =Národní knihovna= k digitalizaci a uchování informací o periodikách a monografiích.

  Podrobnosti o formátech použitých v =PSP= balíčku jsou na stránkách =Národní knihovny=.

  Program je vystaven v repozitáři =Google Code= https://code.google.com/p/psp-validator/

** ve zkratce k projektu
   :PROPERTIES:
   :ID:       1cb9f0aa-7ba2-4bce-bc0d-3dffe29e7a8a
   :END:
   * umi jednu verzi schematu
   * schema se vyvyji
   * budou chodit emaily
   * komunikace v cestine
   * repozitar na code.google.com
   * software bude v anglictine
   * prubezne verze standardu se nebudou publikovat
   * zapojeni krajske knihovny do testovani - posilali by testovaci data pro testovani
   * program by nemel skoncit na prvni chybe. protoze se schema vyvyji a neco uz nemusi byt chybou
   * tentyz program by mel byt k dispozici na webu pro krajske knihovny, aby si mohly dopredu zkontrolovat data
   * program bude mit volbu:
     - kontrolovat jen metadata (mets soubor)
     - zkontrolvoat vsechno, vcetne metadat
     - vypnout kontrolu ciselniku
   * udelat instalator pro windows
   * vystup bude v textovem souboru

** co program umí
   - [X] validuje hlavní soubor =METS= podle schematu =METS=
   - [X] validuje položky =dc= v hlavním souboru =METS= podle schematu =Dublin Core=
   - [X] validuje soubory v adresáři =amdSec= podle schematu =METS=
   - [X] validuje jednotlivé části =premis:object= a =mix:mix= v souborech v adresáři =amdsec=
   - [X] zkontroluje, že všechny linky, které jsou v souboru =METS=, existují
   - [X] zkontroluje =MD5= součet všech souborů, na které se soubor =METS= odkazuje
   - [X] validuje soubory v adresáři =ALTO= podle schematu =ALTO=

   Program vypisuje informace o průběhu validací na konzoli a současně do souboru =log/messages.log=.

   Validovaný balíček rozbaluje do adresáře =tmp=.

   Pokud se programu místo souboru zadá adresář, předpokládá, že v něm jsou =PSP= souboru. Ty všechny zvaliduje.

** instalace programu
*** windows
**** instalace python 2.7
***** stáhnout aktuální verzi pythonu http://www.python.org/ftp/python/2.7.3/python-2.7.3.msi
      a nainstalovat ji.
***** nastavení cesty k binárkám pythonu
      aby se dal volat python v =cmd=.
      
**** instalace lxml
***** instalace binárek
      http://www.lfd.uci.edu/~gohlke/pythonlibs/#lxml
      
      vybere se lxml-X.X.X.win*.exe
      Ten se nainstaluje. Pokud 

**** instalace programu
     - uloží se =zip= balíček ze sekce [[https://code.google.com/p/psp-validator/downloads/list][downloads]]
     - rozbalí se do adresáře =C:\Opt=
     
     Takže program bude v adresáři: =C:\Opt\psp-validator=

     - do proměnné =PATH= se doplní cesta k programu: =C:\Opt\psp-validator\bin\validate-psp.py=

** volání programu
   :PROPERTIES:
   :ID:       4b49694e-cd6c-4454-b479-c8684a2b4160
   :END:
   Pokud jsme ve *Windows*, tak se k cestě k programu přidá název disku: =C:\Opt\psp-validator\bin\validate-psp.py --help=

   #+BEGIN_SRC sh :results output verbatim :exports both
    /opt/psp-validator/bin/validate-psp.py --help
   #+END_SRC

   #+RESULTS:
   #+begin_example
   usage: validate-psp.py [-h] [-m] [-v] [--version] [-l] [-d] [-i INFO]
			  [-p PARTIAL] [-s] [--normdir] [-o]
			  [PSP]

   Program validuje PSP balíček.

   Umí validovat na třech úrovních:
   - METS soubor
   - hodnoty z číselníků existují
   - linky, na ktere se v balíčku odkazuje existují

     Každá z těchto voleb se dá vypnout.

   Program rozbalí zadaný PSP balíček do adresáře /opt/psp-validator/tmp/PSP-Validation-2012-11-07-B_vWM7

   Pokud je zadaný adresář, tak vezme všechny soubory, co mají příponu =.zip=
   a pokusí se je zkontrolovat.

   positional arguments:
     PSP                   cesta k PSP balíčku. Muze to byt soubor, nebo adresar. Pokud to je adresar, vezme všechny soubory a zvaliduje je.

   optional arguments:
     -h, --help            show this help message and exit
     -m, --mets            zkontroluje METS soubor
     -v, --verbose         hlášky programu budou podrobnější
     --version             verze programu. Vypíše i verzi dokumentace, co popisuje strukturu PSP balíčku
     -l, --list-validators
			   zobrazí seznam validací, co program umí
     -d, --debug           zobrazí ladici hlasky
     -i INFO, --info INFO  zobrazí popis vybrané validace
     -p PARTIAL, --partial PARTIAL
			   zavola jen jeden kontretni krok validace. Seznam validaci vypisuje argument -l
     -s, --summary         na konci vypíše přehled testů, co provedl a s jakým skončily výsledkem.
     --normdir             na konci se maže pracovní adresář. S tímto argumentem se adresář nesmaže.
     -o, --oneerror        Kdyz se validuji soubory v adresari, tak skonci pri prvni chybe. Aby tech chyb nebylo moc.
#+end_example

*** přehled dostupných validací
   #+BEGIN_SRC sh :results output verbatim :exports both
   /opt/psp-validator/bin/validate-psp.py -l
   #+END_SRC

   #+RESULTS:
   : seznam validací:
   : 	01_mets
   : 	01_mets_dc
   : 	01_mets_mods
   : 	02_links_checksums
   : 	02_links_exist
   : 	03_techspecs
   : 	03_techspecs_premis_mix
   : 	04_altos

