doc/dokumentace.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>PSP-validátor</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="PSP-validátor"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-07 21:02:46 CET"/>
<meta name="author" content="Jan Stavel"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">PSP-validátor</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 dokumentace</a>
<ul>
<li><a href="#sec-1-1">1.1 ve zkratce k projektu</a></li>
<li><a href="#sec-1-2">1.2 co program umí</a></li>
<li><a href="#sec-1-3">1.3 instalace programu</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 windows</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 volání programu</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 přehled dostupných validací</a></li>
<li><a href="#sec-1-4-2">1.4.2 příklad validace METS souboru</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 jednotlivé validace</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1 kontrola METS souboru</a></li>
<li><a href="#sec-1-5-2">1.5.2 kontrola linek v METS souboru</a></li>
<li><a href="#sec-1-5-3">1.5.3 kontrola souborů v adresáři <code>amdSec</code></a></li>
<li><a href="#sec-1-5-4">1.5.4 kontrola souborů v adresáři <code>ALTO</code></a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6 rady</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1 nejpoužívanější parametry programu</a></li>
<li><a href="#sec-1-6-2">1.6.2 když chci validovat jen hlavní <code>METS</code> soubor</a></li>
<li><a href="#sec-1-6-3">1.6.3 když chci vidět seznam validací, co program umí</a></li>
<li><a href="#sec-1-6-4">1.6.4 když chci vidět informace o jedné validaci</a></li>
<li><a href="#sec-1-6-5">1.6.5 když chci vidět pouze výsledky na konci</a></li>
<li><a href="#sec-1-6-6">1.6.6 když chci vidět výsledky i průběh validace</a></li>
<li><a href="#sec-1-6-7">1.6.7 když chci provést jen určitou validaci</a></li>
<li><a href="#sec-1-6-8">1.6.8 když chci zachovat rozbalený balíček</a></li>
<li><a href="#sec-1-6-9">1.6.9 když program vypisuje hodně chyb</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><a name="ID-20d91565-bc03-4147-8d00-b59825f48f37" id="ID-20d91565-bc03-4147-8d00-b59825f48f37"></a><span class="section-number-2">1</span> dokumentace</h2>
<div class="outline-text-2" id="text-1">

<p>  Program validuje <code>PSP</code> balíček, nebo celý adresář <code>PSP</code> balíčků.
</p>
<p>
  <code>PSP</code> se používá k uchování digitálních informací o periodikách a monografiích. 
  Tento balíček používá <code>Národní knihovna</code> k digitalizaci a uchování informací o periodikách a monografiích.
</p>
<p>
  Podrobnosti o formátech použitých v <code>PSP</code> balíčku jsou na stránkách <code>Národní knihovny</code>.
</p>
<p>
  Program je vystaven v repozitáři <code>Google Code</code> <a href="https://code.google.com/p/psp-validator/">https://code.google.com/p/psp-validator/</a>
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><a name="ID-1cb9f0aa-7ba2-4bce-bc0d-3dffe29e7a8a" id="ID-1cb9f0aa-7ba2-4bce-bc0d-3dffe29e7a8a"></a><span class="section-number-3">1.1</span> ve zkratce k projektu</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>umi jednu verzi schematu
</li>
<li>schema se vyvyji
</li>
<li>budou chodit emaily
</li>
<li>komunikace v cestine
</li>
<li>repozitar na code.google.com
</li>
<li>software bude v anglictine
</li>
<li>prubezne verze standardu se nebudou publikovat
</li>
<li>zapojeni krajske knihovny do testovani - posilali by testovaci data pro testovani
</li>
<li>program by nemel skoncit na prvni chybe. protoze se schema vyvyji a neco uz nemusi byt chybou
</li>
<li>tentyz program by mel byt k dispozici na webu pro krajske knihovny, aby si mohly dopredu zkontrolovat data
</li>
<li>program bude mit volbu:
<ul>
<li>kontrolovat jen metadata (mets soubor)
</li>
<li>zkontrolvoat vsechno, vcetne metadat
</li>
<li>vypnout kontrolu ciselniku
</li>
</ul>

</li>
<li>udelat instalator pro windows
</li>
<li>vystup bude v textovem souboru
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> co program umí</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li><code>[X]</code> validuje hlavní soubor <code>METS</code> podle schematu <code>METS</code>
</li>
<li><code>[X]</code> validuje položky <code>dc</code> v hlavním souboru <code>METS</code> podle schematu <code>Dublin Core</code>
</li>
<li><code>[X]</code> validuje soubory v adresáři <code>amdSec</code> podle schematu <code>METS</code>
</li>
<li><code>[X]</code> validuje jednotlivé části <code>premis:object</code> a <code>mix:mix</code> v souborech v adresáři <code>amdsec</code>
</li>
<li><code>[X]</code> zkontroluje, že všechny linky, které jsou v souboru <code>METS</code>, existují
</li>
<li><code>[X]</code> zkontroluje <code>MD5</code> součet všech souborů, na které se soubor <code>METS</code> odkazuje
</li>
<li><code>[X]</code> validuje soubory v adresáři <code>ALTO</code> podle schematu <code>ALTO</code>
</li>
</ul>


<p>
   Program vypisuje informace o průběhu validací na konzoli a současně do souboru <code>log/messages.log</code>.
</p>
<p>
   Validovaný balíček rozbaluje do adresáře <code>tmp</code>.
</p>
<p>
   Pokud se programu místo souboru zadá adresář, předpokládá, že v něm jsou <code>PSP</code> souboru. Ty všechny zvaliduje.
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> instalace programu</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> windows</h4>
<div class="outline-text-4" id="text-1-3-1">

<ul>
<li id="sec-1-3-1-1">instalace python 2.7<br/>
<ul>
<li id="sec-1-3-1-1-1">stáhnout aktuální verzi pythonu <a href="http://www.python.org/ftp/python/2.7.3/python-2.7.3.msi">http://www.python.org/ftp/python/2.7.3/python-2.7.3.msi</a><br/>
      a nainstalovat ji.
</li>
</ul>
<ul>
<li id="sec-1-3-1-1-2">nastavení cesty k binárkám pythonu<br/>
      aby se dal volat python v <code>cmd</code>.

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-3-1-2">instalace lxml<br/>
<ul>
<li id="sec-1-3-1-2-1">instalace binárek<br/>
      <a href="http://www.lfd.uci.edu/~gohlke/pythonlibs/#lxml">http://www.lfd.uci.edu/~gohlke/pythonlibs/#lxml</a>

<p>      
      vybere se lxml-X.X.X.win*.exe
      Ten se nainstaluje. Pokud 
</p>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-1-3-1-3">instalace programu<br/>
<ul>
<li>uloží se <code>zip</code> balíček ze sekce <a href="https://code.google.com/p/psp-validator/downloads/list">downloads</a>
</li>
<li>rozbalí se do adresáře <code>C:\Opt</code>
</li>
</ul>


<p>     
     Takže program bude v adresáři: <code>C:\Opt\psp-validator</code>
</p>
<ul>
<li>do proměnné <code>PATH</code> se doplní cesta k programu: <code>C:\Opt\psp-validator\bin\validate-psp.py</code>
</li>
</ul>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><a name="ID-4b49694e-cd6c-4454-b479-c8684a2b4160" id="ID-4b49694e-cd6c-4454-b479-c8684a2b4160"></a><span class="section-number-3">1.4</span> volání programu</h3>
<div class="outline-text-3" id="text-1-4">

<p>   Pokud jsme ve <b>Windows</b>, tak se k cestě k programu přidá název disku: <code>C:\Opt\psp-validator\bin\validate-psp.py --help</code>
</p>



<pre class="src src-sh">/opt/psp-validator/bin/validate-psp.py --help
</pre>



   

<pre class="example">usage: validate-psp.py [-h] [-m] [-v] [--version] [-l] [-d] [-i INFO]
                       [-p PARTIAL] [-s] [--normdir] [-o]
                       [PSP]

Program validuje PSP balíček.

Umí validovat na třech úrovních:
- METS soubor
- hodnoty z číselníků existují
- linky, na ktere se v balíčku odkazuje existují

  Každá z těchto voleb se dá vypnout.

Program rozbalí zadaný PSP balíček do adresáře /opt/psp-validator/tmp/PSP-Validation-2012-11-07-B_vWM7

Pokud je zadaný adresář, tak vezme všechny soubory, co mají příponu =.zip=
a pokusí se je zkontrolovat.

positional arguments:
  PSP                   cesta k PSP balíčku. Muze to byt soubor, nebo adresar. Pokud to je adresar, vezme všechny soubory a zvaliduje je.

optional arguments:
  -h, --help            show this help message and exit
  -m, --mets            zkontroluje METS soubor
  -v, --verbose         hlášky programu budou podrobnější
  --version             verze programu. Vypíše i verzi dokumentace, co popisuje strukturu PSP balíčku
  -l, --list-validators
                        zobrazí seznam validací, co program umí
  -d, --debug           zobrazí ladici hlasky
  -i INFO, --info INFO  zobrazí popis vybrané validace
  -p PARTIAL, --partial PARTIAL
                        zavola jen jeden kontretni krok validace. Seznam validaci vypisuje argument -l
  -s, --summary         na konci vypíše přehled testů, co provedl a s jakým skončily výsledkem.
  --normdir             na konci se maže pracovní adresář. S tímto argumentem se adresář nesmaže.
  -o, --oneerror        Kdyz se validuji soubory v adresari, tak skonci pri prvni chybe. Aby tech chyb nebylo moc.
</pre>



</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> přehled dostupných validací</h4>
<div class="outline-text-4" id="text-1-4-1">




<pre class="src src-sh">/opt/psp-validator/bin/validate-psp.py -l
</pre>


<pre class="example">
seznam validací:
   01_mets
   01_mets_dc
   01_mets_mods
   02_links_checksums
   02_links_exist
   03_techspecs
   03_techspecs_premis_mix
   04_altos
</pre>


</div>

</div>
