doc/dokumentace.org
** jednotlivé validace
*** kontrola METS souboru
**** ~01_mets~
    #+BEGIN_SRC sh :results output verbatim :exports both
     /opt/psp-validator/bin/validate-psp.py -i 01_mets
    #+END_SRC     

    #+RESULTS:
    :  validace hlavního METS souboru
    :         validuje hlavní METS soubor podle specifikace METS

**** ~01_mets_dc~
    #+BEGIN_SRC sh :results output verbatim  :exports both
     /opt/psp-validator/bin/validate-psp.py -i 01_mets_dc
    #+END_SRC     

    #+RESULTS:
    :  validace vnitřku METS souboru, specifikace DC
    :         validuje vnitřní položky DC v METS soubor podle specifikace Dublin Core

**** ~01_mets_mods~
    #+BEGIN_SRC sh :results output verbatim  :exports both
     /opt/psp-validator/bin/validate-psp.py -i 01_mets_mods
    #+END_SRC     

    #+RESULTS:
    :  validace vnitřku hlavního METS souboru, specifikace MODS
    :         validuje vnitřní položky MODS v hlavním METS soubor podle specifikace MODS

*** kontrola linek v METS souboru
    Zkontroluje se, jestli se linky odkazují na existující soubory a jestli tyto soubory mají správný kontrolní součet.
**** ~02_links_checksums~
    #+BEGIN_SRC sh :results output verbatim :exports both
     /opt/psp-validator/bin/validate-psp.py -i 02_links_checksums
    #+END_SRC     

    #+RESULTS:
    :  kontrola CHECKSUM všech souborů na které se v hlavním METS souboru odkazuje
    :         zkontroluje, zda mají soubory, na které linky odkazují, správnou CHECKSUM.

**** ~02_links_exist~
    #+BEGIN_SRC sh :results output verbatim :exports both
     /opt/psp-validator/bin/validate-psp.py -i 02_links_exist
    #+END_SRC     

    #+RESULTS:
    :  validace linek v hlavním METS souboru
    :         zkontroluje, zda existují všechny soubory na které se odkazují linky v hlavním souboru METS.

    

*** kontrola souborů v adresáři =amdSec=
**** ~03_techspecs~
    #+BEGIN_SRC sh :results output verbatim :exports both
     /opt/psp-validator/bin/validate-psp.py -i 03_techspecs
    #+END_SRC     

    #+RESULTS:
    :  validace souborů ve složce amdSec
    :         zkontroluje předběžně jednotlivé soubory ve složce =amdSec= podle formátu METS

**** ~03_techspecs_premis_mix~
    #+BEGIN_SRC sh :results output verbatim :exports both
     /opt/psp-validator/bin/validate-psp.py -i 03_techspecs_premis_mix
    #+END_SRC     

    #+RESULTS:
    :  validace souborů ve složce amdSec na technická metadata
    :         zkontroluje, zda jednotlivé soubory odpovídají použitým schematům.
    :         To je formát METS a vevnitřs jsou polozky =premis:object= podle schematu PREMIS v2.1. a položky =mix:mix= ve formatu MIX

*** kontrola souborů v adresáři =ALTO=
**** ~04_altos~
    #+BEGIN_SRC sh :results output verbatim :exports both
     /opt/psp-validator/bin/validate-psp.py -i 04_altos
    #+END_SRC     

    #+RESULTS:
    :  validace souborů v adresáři =ALTO=
    :         zkontroluje předběžně každý soubor ve složce ALTO podle schematu ALTO

** rady
*** nejpoužívanější parametry programu
    #+BEGIN_EXAMPLE
     /opt/psp-validator/bin/validate-psp.py -s -o DIR
    #+END_EXAMPLE     
    
    Program na konci vypíše jen přehled provedených validací. 
    
    Při validaci jednotlivých souborů skončí při první chybě.
    
*** když chci validovat jen hlavní =METS= soubor
    #+BEGIN_EXAMPLE
     /opt/psp-validator/bin/validate-psp.py -m -s /opt/psp-validator/tmp/complete_NDK-000000000008_1350896484227.zip
    #+END_EXAMPLE     

    Program provede jen validace spojené s hlavním =METS= souborem.
    
*** když chci vidět seznam validací, co program umí
    #+BEGIN_EXAMPLE
     /opt/psp-validator/bin/validate-psp.py -l
    #+END_EXAMPLE     

    Program vypíše seznam dostupných validací.
    
*** když chci vidět informace o jedné validaci
    #+BEGIN_EXAMPLE
     /opt/psp-validator/bin/validate-psp.py -i 04_altos
    #+END_EXAMPLE    

    Program vypíše podrobné informace o vybrané validaci.

*** když chci vidět pouze výsledky na konci
    #+BEGIN_EXAMPLE
     /opt/psp-validator/bin/validate-psp.py -s /opt/psp-validator/tmp/complete_NDK-000000000008_1350896484227.zip
    #+END_EXAMPLE     

    Program na konci vypíše přehled provedených validací a jejich výsledek.

*** když chci vidět výsledky i průběh validace
    #+BEGIN_EXAMPLE
     /opt/psp-validator/bin/validate-psp.py -v -s /opt/psp-validator/tmp/complete_NDK-000000000008_1350896484227.zip
    #+END_EXAMPLE     

    Program bude průběžně informovat o tom, co provádí a na konci vypíše přehled provedených validací a jejich výsledek.

*** když chci provést jen určitou validaci
    #+BEGIN_EXAMPLE
     /opt/psp-validator/bin/validate-psp.py -p 03_techspecs /opt/psp-validator/tmp/complete_NDK-000000000008_1350896484227.zip
    #+END_EXAMPLE

    Program provede jen vybranou validaci a skončí.

*** když chci zachovat rozbalený balíček
    #+BEGIN_EXAMPLE
     /opt/psp-validator/bin/validate-psp.py -s -p 03_techspecs --normdir /opt/psp-validator/tmp/complete_NDK-000000000008_1350896484227.zip
    #+END_EXAMPLE

    Program na konci ponechá rozbalený balíček.

*** když program vypisuje hodně chyb
    - pustím program se souhrnným výpisem na konci
    - zjistím, které validace neprošly
    - pustím program s dotyčnou validací a aby skončil při první chybě a zachoval rozbalený balíček
    #+BEGIN_EXAMPLE
     /opt/psp-validator/bin/validate-psp.py -v -s -p 03_techspecs --normdir --oneerror /opt/psp-validator/tmp/complete_NDK-000000000008_1350896484227.zip
    #+END_EXAMPLE
