doc/dokumentace.html

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> jednotlivé validace</h3>
<div class="outline-text-3" id="text-1-5">


</div>

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> kontrola METS souboru</h4>
<div class="outline-text-4" id="text-1-5-1">

<ul>
<li id="sec-1-5-1-1"><code>01_mets</code><br/>



<pre class="src src-sh">/opt/psp-validator/bin/validate-psp.py -i 01_mets
</pre>


<pre class="example">
 validace hlavního METS souboru
        validuje hlavní METS soubor podle specifikace METS
</pre>


</li>
</ul>
<ul>
<li id="sec-1-5-1-2"><code>01_mets_dc</code><br/>



<pre class="src src-sh">/opt/psp-validator/bin/validate-psp.py -i 01_mets_dc
</pre>


<pre class="example">
 validace vnitřku METS souboru, specifikace DC
        validuje vnitřní položky DC v METS soubor podle specifikace Dublin Core
</pre>


</li>
</ul>
<ul>
<li id="sec-1-5-1-3"><code>01_mets_mods</code><br/>



<pre class="src src-sh">/opt/psp-validator/bin/validate-psp.py -i 01_mets_mods
</pre>


<pre class="example">
 validace vnitřku hlavního METS souboru, specifikace MODS
        validuje vnitřní položky MODS v hlavním METS soubor podle specifikace MODS
</pre>


</li>
</ul>
</div>

</div>

<div id="outline-container-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> kontrola linek v METS souboru</h4>
<div class="outline-text-4" id="text-1-5-2">

<p>    Zkontroluje se, jestli se linky odkazují na existující soubory a jestli tyto soubory mají správný kontrolní součet.
</p><ul>
<li id="sec-1-5-2-1"><code>02_links_checksums</code><br/>



<pre class="src src-sh">/opt/psp-validator/bin/validate-psp.py -i 02_links_checksums
</pre>


<pre class="example">
 kontrola CHECKSUM všech souborů na které se v hlavním METS souboru odkazuje
        zkontroluje, zda mají soubory, na které linky odkazují, správnou CHECKSUM.
</pre>


</li>
</ul>
<ul>
<li id="sec-1-5-2-2"><code>02_links_exist</code><br/>



<pre class="src src-sh">/opt/psp-validator/bin/validate-psp.py -i 02_links_exist
</pre>


<pre class="example">
 validace linek v hlavním METS souboru
        zkontroluje, zda existují všechny soubory na které se odkazují linky v hlavním souboru METS.
</pre>




</li>
</ul>
</div>

</div>

<div id="outline-container-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> kontrola souborů v adresáři <code>amdSec</code></h4>
<div class="outline-text-4" id="text-1-5-3">

<ul>
<li id="sec-1-5-3-1"><code>03_techspecs</code><br/>



<pre class="src src-sh">/opt/psp-validator/bin/validate-psp.py -i 03_techspecs
</pre>


<pre class="example">
 validace souborů ve složce amdSec
        zkontroluje předběžně jednotlivé soubory ve složce =amdSec= podle formátu METS
</pre>


</li>
</ul>
<ul>
<li id="sec-1-5-3-2"><code>03_techspecs_premis_mix</code><br/>



<pre class="src src-sh">/opt/psp-validator/bin/validate-psp.py -i 03_techspecs_premis_mix
</pre>


<pre class="example">
 validace souborů ve složce amdSec na technická metadata
        zkontroluje, zda jednotlivé soubory odpovídají použitým schematům.
        To je formát METS a vevnitřs jsou polozky =premis:object= podle schematu PREMIS v2.1. a položky =mix:mix= ve formatu MIX
</pre>


</li>
</ul>
</div>

</div>

<div id="outline-container-1-5-4" class="outline-4">
<h4 id="sec-1-5-4"><span class="section-number-4">1.5.4</span> kontrola souborů v adresáři <code>ALTO</code></h4>
<div class="outline-text-4" id="text-1-5-4">

<ul>
<li id="sec-1-5-4-1"><code>04_altos</code><br/>



<pre class="src src-sh">/opt/psp-validator/bin/validate-psp.py -i 04_altos
</pre>


<pre class="example">
 validace souborů v adresáři =ALTO=
        zkontroluje předběžně každý soubor ve složce ALTO podle schematu ALTO
</pre>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> rady</h3>
<div class="outline-text-3" id="text-1-6">


</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> nejpoužívanější parametry programu</h4>
<div class="outline-text-4" id="text-1-6-1">




<pre class="example">/opt/psp-validator/bin/validate-psp.py -s -o DIR
</pre>


<p>    
    Program na konci vypíše jen přehled provedených validací. 
</p>
<p>    
    Při validaci jednotlivých souborů skončí při první chybě.
</p>
</div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> když chci validovat jen hlavní <code>METS</code> soubor</h4>
<div class="outline-text-4" id="text-1-6-2">




<pre class="example">/opt/psp-validator/bin/validate-psp.py -m -s /opt/psp-validator/tmp/complete_NDK-000000000008_1350896484227.zip
</pre>


<p>
    Program provede jen validace spojené s hlavním <code>METS</code> souborem.
</p>
</div>

</div>

<div id="outline-container-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><span class="section-number-4">1.6.3</span> když chci vidět seznam validací, co program umí</h4>
<div class="outline-text-4" id="text-1-6-3">




<pre class="example">/opt/psp-validator/bin/validate-psp.py -l
</pre>


<p>
    Program vypíše seznam dostupných validací.
</p>
</div>

</div>

<div id="outline-container-1-6-4" class="outline-4">
<h4 id="sec-1-6-4"><span class="section-number-4">1.6.4</span> když chci vidět informace o jedné validaci</h4>
<div class="outline-text-4" id="text-1-6-4">




<pre class="example">/opt/psp-validator/bin/validate-psp.py -i 04_altos
</pre>


<p>
    Program vypíše podrobné informace o vybrané validaci.
</p>
</div>

</div>

<div id="outline-container-1-6-5" class="outline-4">
<h4 id="sec-1-6-5"><span class="section-number-4">1.6.5</span> když chci vidět pouze výsledky na konci</h4>
<div class="outline-text-4" id="text-1-6-5">




<pre class="example">/opt/psp-validator/bin/validate-psp.py -s /opt/psp-validator/tmp/complete_NDK-000000000008_1350896484227.zip
</pre>


<p>
    Program na konci vypíše přehled provedených validací a jejich výsledek.
</p>
</div>

</div>

<div id="outline-container-1-6-6" class="outline-4">
<h4 id="sec-1-6-6"><span class="section-number-4">1.6.6</span> když chci vidět výsledky i průběh validace</h4>
<div class="outline-text-4" id="text-1-6-6">




<pre class="example">/opt/psp-validator/bin/validate-psp.py -v -s /opt/psp-validator/tmp/complete_NDK-000000000008_1350896484227.zip
</pre>


<p>
    Program bude průběžně informovat o tom, co provádí a na konci vypíše přehled provedených validací a jejich výsledek.
</p>
</div>

</div>

<div id="outline-container-1-6-7" class="outline-4">
<h4 id="sec-1-6-7"><span class="section-number-4">1.6.7</span> když chci provést jen určitou validaci</h4>
<div class="outline-text-4" id="text-1-6-7">




<pre class="example">/opt/psp-validator/bin/validate-psp.py -p 03_techspecs /opt/psp-validator/tmp/complete_NDK-000000000008_1350896484227.zip
</pre>


<p>
    Program provede jen vybranou validaci a skončí.
</p>
</div>

</div>

<div id="outline-container-1-6-8" class="outline-4">
<h4 id="sec-1-6-8"><span class="section-number-4">1.6.8</span> když chci zachovat rozbalený balíček</h4>
<div class="outline-text-4" id="text-1-6-8">




<pre class="example">/opt/psp-validator/bin/validate-psp.py -s -p 03_techspecs --normdir /opt/psp-validator/tmp/complete_NDK-000000000008_1350896484227.zip
</pre>


<p>
    Program na konci ponechá rozbalený balíček.
</p>
</div>

</div>

<div id="outline-container-1-6-9" class="outline-4">
<h4 id="sec-1-6-9"><span class="section-number-4">1.6.9</span> když program vypisuje hodně chyb</h4>
<div class="outline-text-4" id="text-1-6-9">

<ul>
<li>pustím program se souhrnným výpisem na konci
</li>
<li>zjistím, které validace neprošly
</li>
<li>pustím program s dotyčnou validací a aby skončil při první chybě a zachoval rozbalený balíček
</li>
</ul>




<pre class="example">/opt/psp-validator/bin/validate-psp.py -v -s -p 03_techspecs --normdir --oneerror /opt/psp-validator/tmp/complete_NDK-000000000008_1350896484227.zip
</pre>

</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-11-07 21:02:46 CET</p>
<p class="author">Author: Jan Stavel</p>
<p class="creator">Org version 7.8.11 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
